---
kind: property
id: P:Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureURepeat
source: html/2d4a8b51-207f-748b-216e-b95d0157ed87.htm
---
# Autodesk.Revit.DB.Visual.UnifiedBitmap.TextureURepeat Property

The property labeled "U Repeat" from the "UnifiedBitmap" schema.

## Syntax (C#)
```csharp
public static string TextureURepeat { get; }
```

## Remarks
This property is of type "AssetPropertyBoolean".